In [1]:
import numpy as np
import pandas as pd

In [2]:
#membuat data frame dengan datanya random terdiri dari 5 baris dan 4 kolom
#dengan index nya adalah A B C D E yang di split
#split adalah memotong-motong string dan menjadikanya sebuaah array
#metetapkan kolomnya adalah w x y z yang di split
df = pd.DataFrame(np.random.randn(5,4),index='A B C D E'. split(),columns='w x y z'.split())
df

          w         x         y         z
A  0.410776 -1.402272 -1.299132  0.184396
B  1.390631 -1.133008 -1.298900 -0.352064
C -1.240956  0.648486  0.237391  0.261157
D  1.312979  0.042596 -0.145400 -0.612080
E -0.732012  0.232973 -1.234266 -0.209095

In [3]:
df['w'] #menampilkan data pada kolom w

A    0.410776
B    1.390631
C   -1.240956
D    1.312979
E   -0.732012
Name: w, dtype: float64

In [4]:
df.w #bisa juga seperti ini

A    0.410776
B    1.390631
C   -1.240956
D    1.312979
E   -0.732012
Name: w, dtype: float64

In [5]:
df[['w','z']]

          w         z
A  0.410776  0.184396
B  1.390631 -0.352064
C -1.240956  0.261157
D  1.312979 -0.612080
E -0.732012 -0.209095

In [6]:
#membuat koom baru yang datanya diambil dari kolom lainnya
df['baru'] = df['w'] + df['y']

In [7]:
df

          w         x         y         z      baru
A  0.410776 -1.402272 -1.299132  0.184396 -0.888356
B  1.390631 -1.133008 -1.298900 -0.352064  0.091731
C -1.240956  0.648486  0.237391  0.261157 -1.003565
D  1.312979  0.042596 -0.145400 -0.612080  1.167579
E -0.732012  0.232973 -1.234266 -0.209095 -1.966278

In [8]:
df.drop('baru', axis=1) #baru adalah nama kolom dan axis adalah posisi atau tempat yang akan dihapus
                        #jika 0 = index dan jika 1 = kolom

          w         x         y         z
A  0.410776 -1.402272 -1.299132  0.184396
B  1.390631 -1.133008 -1.298900 -0.352064
C -1.240956  0.648486  0.237391  0.261157
D  1.312979  0.042596 -0.145400 -0.612080
E -0.732012  0.232973 -1.234266 -0.209095

In [9]:
df #memakai cara diatas berhasil tapi ketika dipanggil kembali

          w         x         y         z      baru
A  0.410776 -1.402272 -1.299132  0.184396 -0.888356
B  1.390631 -1.133008 -1.298900 -0.352064  0.091731
C -1.240956  0.648486  0.237391  0.261157 -1.003565
D  1.312979  0.042596 -0.145400 -0.612080  1.167579
E -0.732012  0.232973 -1.234266 -0.209095 -1.966278

In [10]:
#zdia massih ada lalu bagaimana. caranya adalah
df.drop('baru', axis=1, inplace=True) #ketika inplace true maka akan mengeksekusi langsung ditempat
                                    #tetapi tidak bisa menampilkan langsung datanya

In [11]:
df

          w         x         y         z
A  0.410776 -1.402272 -1.299132  0.184396
B  1.390631 -1.133008 -1.298900 -0.352064
C -1.240956  0.648486  0.237391  0.261157
D  1.312979  0.042596 -0.145400 -0.612080
E -0.732012  0.232973 -1.234266 -0.209095

In [12]:
df.drop('E',axis=0) #axis=0 adalah baris

          w         x         y         z
A  0.410776 -1.402272 -1.299132  0.184396
B  1.390631 -1.133008 -1.298900 -0.352064
C -1.240956  0.648486  0.237391  0.261157
D  1.312979  0.042596 -0.145400 -0.612080

In [13]:
df.loc['A'] #A adalah nama index label

w    0.410776
x   -1.402272
y   -1.299132
z    0.184396
Name: A, dtype: float64

In [14]:
df.iloc[2] #untuk mendapatkan data by index

w   -1.240956
x    0.648486
y    0.237391
z    0.261157
Name: C, dtype: float64

In [15]:
df.loc['C','z'] #mendapatkan data terperinci
                #mengambil data dari baris c dan kolom z

0.26115744250359374

In [16]:
df.loc[['A','B'],['w','y']] #mengambil data dari baris a dan b dan kolom w dan y

          w         y
A  0.410776 -1.299132
B  1.390631 -1.298900

In [17]:
df > 0 #menyeleksi data yang lebih dari 0

       w      x      y      z
A   True  False  False   True
B   True  False  False  False
C  False   True   True   True
D   True   True  False  False
E  False   True  False  False

In [18]:
df[df>0]

          w         x         y         z
A  0.410776       NaN       NaN  0.184396
B  1.390631       NaN       NaN       NaN
C       NaN  0.648486  0.237391  0.261157
D  1.312979  0.042596       NaN       NaN
E       NaN  0.232973       NaN       NaN

In [20]:
#menampilkan data berdasarkan kolom w yang lebih dari 0
df[df['w']>0]

          w         x         y         z
A  0.410776 -1.402272 -1.299132  0.184396
B  1.390631 -1.133008 -1.298900 -0.352064
D  1.312979  0.042596 -0.145400 -0.612080

In [21]:
#menampilkan data Y berdasarkan pada kolom w yang lebih dari 0
df[df['w']>0]['y']

A   -1.299132
B   -1.298900
D   -0.145400
Name: y, dtype: float64

In [22]:
#menampilkan data kolom y dan x berdasarkan pada kolom w yang lebih dari 0
df[df['w']>0][['y','x']]

          y         x
A -1.299132 -1.402272
B -1.298900 -1.133008
D -0.145400  0.042596

In [23]:
#menampilkan data berdasarkan kolom w yang lebih dari 0 dan kolom x lebih dari 1
df[(df['w']>0) & (df['x'] >1)]

Empty DataFrame
Columns: [w, x, y, z]
Index: []

In [24]:
#menamplkan data berdarkan kolom w yang lebih dari 0 dan kolom x lebih dari 0
df[(df['w']>0) | (df['x'] >0)]

          w         x         y         z
A  0.410776 -1.402272 -1.299132  0.184396
B  1.390631 -1.133008 -1.298900 -0.352064
C -1.240956  0.648486  0.237391  0.261157
D  1.312979  0.042596 -0.145400 -0.612080
E -0.732012  0.232973 -1.234266 -0.209095

In [26]:
df.reset_index() #mereset index label menjadi index default

  index         w         x         y         z
0     A  0.410776 -1.402272 -1.299132  0.184396
1     B  1.390631 -1.133008 -1.298900 -0.352064
2     C -1.240956  0.648486  0.237391  0.261157
3     D  1.312979  0.042596 -0.145400 -0.612080
4     E -0.732012  0.232973 -1.234266 -0.209095

In [27]:
#membuat kolom baru
df["code"] = "IND JPN USA RSA IND" .split()

In [28]:
df

          w         x         y         z code
A  0.410776 -1.402272 -1.299132  0.184396  IND
B  1.390631 -1.133008 -1.298900 -0.352064  JPN
C -1.240956  0.648486  0.237391  0.261157  USA
D  1.312979  0.042596 -0.145400 -0.612080  RSA
E -0.732012  0.232973 -1.234266 -0.209095  IND

In [29]:
df.set_index('code') #mengatur agar code menjadi index labels

             w         x         y         z
code
IND   0.410776 -1.402272 -1.299132  0.184396
JPN   1.390631 -1.133008 -1.298900 -0.352064
USA  -1.240956  0.648486  0.237391  0.261157
RSA   1.312979  0.042596 -0.145400 -0.612080
IND  -0.732012  0.232973 -1.234266 -0.209095

In [30]:
#ketika ditampilkan sama seprti 
df

          w         x         y         z code
A  0.410776 -1.402272 -1.299132  0.184396  IND
B  1.390631 -1.133008 -1.298900 -0.352064  JPN
C -1.240956  0.648486  0.237391  0.261157  USA
D  1.312979  0.042596 -0.145400 -0.612080  RSA
E -0.732012  0.232973 -1.234266 -0.209095  IND

In [32]:
#drop tidak berubah dan harus menggunakna inplace
df.set_index('code',inplace=True)

In [33]:
df

             w         x         y         z
code
IND   0.410776 -1.402272 -1.299132  0.184396
JPN   1.390631 -1.133008 -1.298900 -0.352064
USA  -1.240956  0.648486  0.237391  0.261157
RSA   1.312979  0.042596 -0.145400 -0.612080
IND  -0.732012  0.232973 -1.234266 -0.209095

In [39]:
dataLabels =['G1','G1','G1', 'G2','G2','G2' ]
dataValue =[1,2,3,1,2,3]
data = list(zip(dataLabels,dataValue)) #zip : mengubah 2 array atau lebih menjadi beberapa tuple
                                        #list : membuat list dari tuple-tuple yang ada
data = pd.MultiIndex.from_tuples(data)  #multiIndex : membuat beberapa pengindexkan baru dari sebuah tuple

In [40]:
list(zip(dataLabels,dataValue))

[('G1', 1), ('G1', 2), ('G1', 3), ('G2', 1), ('G2', 2), ('G2', 3)]

In [41]:
data

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [48]:
df = pd.DataFrame(np.random.randn(6,2), index=data,columns=['A','B'])
df
#membuat datafrme baru dengan data random 6 baris 2 kolom
#index dari data frame ini adalah variable data dikarenakan terdapat bantyak data kembbar maka
#data tersebut dikemas yaitu G1 dan G2,dan 123 menjadi sub indexnya
#nama kolomnya adalah A dan B

             A         B
G1 1  0.068674  1.104161
   2  0.606218  0.774932
   3  1.029497  0.891810
G2 1  0.720948  0.066911
   2  0.771434 -0.232547
   3  0.802357  1.833943

In [50]:
df.loc['G1'] #menampilkan index dari G1

          A         B
1  0.068674  1.104161
2  0.606218  0.774932
3  1.029497  0.891810

In [51]:
df.loc['G1'].loc[3] #menampilkan index dari G1 sub index 3

A    1.029497
B    0.891810
Name: 3, dtype: float64

In [52]:
#melihat nama index
df.index.names

FrozenList([None, None])

In [53]:
#merubah nama index
df.index.names = ['Group', 'num']
df

                  A         B
Group num
G1    1    0.068674  1.104161
      2    0.606218  0.774932
      3    1.029497  0.891810
G2    1    0.720948  0.066911
      2    0.771434 -0.232547
      3    0.802357  1.833943

In [55]:
df.xs('G1') #ax : untuk menampilkan data multiplax

            A         B
num
1    0.068674  1.104161
2    0.606218  0.774932
3    1.029497  0.891810

In [56]:
df.xs(['G2',2]) #menampilkan index label G2 dengan subindex 2

A    0.771434
B   -0.232547
Name: (G2, 2), dtype: float64

In [58]:
df.xs(1,level='num')

              A         B
Group
G1     0.068674  1.104161
G2     0.720948  0.066911